{"keras_version": "2.1.2", "class_name": "Model", "backend": "tensorflow", "config": {"name": "model_1", "input_layers": [["input_1", 0, 0]], "output_layers": [["dense_1", 0, 0]], "layers": [{"name": "input_1", "inbound_nodes": [], "config": {"batch_input_shape": [null, 256, 256, 3], "name": "input_1", "dtype": "float32", "sparse": false}, "class_name": "InputLayer"}, {"name": "conv1", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"activity_regularizer": null, "kernel_size": [7, 7], "filters": 64, "name": "conv1", "bias_regularizer": null, "strides": [2, 2], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "dilation_rate": [1, 1], "padding": "same", "use_bias": true, "data_format": "channels_last", "bias_constraint": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null}, "class_name": "Conv2D"}, {"name": "bn_conv1", "inbound_nodes": [[["conv1", 0, 0, {}]]], "config": {"trainable": true, "gamma_constraint": null, "name": "bn_conv1", "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "axis": 3, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "gamma_regularizer": null}, "class_name": "BatchNormalization"}, {"name": "activation_1", "inbound_nodes": [[["bn_conv1", 0, 0, {}]]], "config": {"name": "activation_1", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"name": "max_pooling2d_1", "inbound_nodes": [[["activation_1", 0, 0, {}]]], "config": {"padding": "valid", "data_format": "channels_last", "pool_size": [3, 3], "name": "max_pooling2d_1", "strides": [2, 2], "trainable": true}, "class_name": "MaxPooling2D"}, {"name": "res2a_branch2a", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "config": {"activity_regularizer": null, "kernel_size": [1, 1], "filters": 64, "name": "res2a_branch2a", "bias_regularizer": null, "strides": [1, 1], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "dilation_rate": [1, 1], "padding": "valid", "use_bias": true, "data_format": "channels_last", "bias_constraint": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null}, "class_name": "Conv2D"}, {"name": "bn2a_branch2a", "inbound_nodes": [[["res2a_branch2a", 0, 0, {}]]], "config": {"trainable": true, "gamma_constraint": null, "name": "bn2a_branch2a", "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "axis": 3, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "gamma_regularizer": null}, "class_name": "BatchNormalization"}, {"name": "activation_2", "inbound_nodes": [[["bn2a_branch2a", 0, 0, {}]]], "config": {"name": "activation_2", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"name": "res2a_branch2b", "inbound_nodes": [[["activation_2", 0, 0, {}]]], "config": {"activity_regularizer": null, "kernel_size": [3, 3], "filters": 64, "name": "res2a_branch2b", "bias_regularizer": null, "strides": [1, 1], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "dilation_rate": [1, 1], "padding": "same", "use_bias": true, "data_format": "channels_last", "bias_constraint": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null}, "class_name": "Conv2D"}, {"name": "bn2a_branch2b", "inbound_nodes": [[["res2a_branch2b", 0, 0, {}]]], "config": {"trainable": true, "gamma_constraint": null, "name": "bn2a_branch2b", "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "axis": 3, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "gamma_regularizer": null}, "class_name": "BatchNormalization"}, {"name": "activation_3", "inbound_nodes": [[["bn2a_branch2b", 0, 0, {}]]], "config": {"name": "activation_3", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"name": "res2a_branch2c", "inbound_nodes": [[["activation_3", 0, 0, {}]]], "config": {"activity_regularizer": null, "kernel_size": [1, 1], "filters": 256, "name": "res2a_branch2c", "bias_regularizer": null, "strides": [1, 1], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "dilation_rate": [1, 1], "padding": "valid", "use_bias": true, "data_format": "channels_last", "bias_constraint": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null}, "class_name": "Conv2D"}, {"name": "res2a_branch1", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "config": {"activity_regularizer": null, "kernel_size": [1, 1], "filters": 256, "name": "res2a_branch1", "bias_regularizer": null, "strides": [1, 1], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "dilation_rate": [1, 1], "padding": "valid", "use_bias": true, "data_format": "channels_last", "bias_constraint": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null}, "class_name": "Conv2D"}, {"name": "bn2a_branch2c", "inbound_nodes": [[["res2a_branch2c", 0, 0, {}]]], "config": {"trainable": true, "gamma_constraint": null, "name": "bn2a_branch2c", "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "axis": 3, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "gamma_regularizer": null}, "class_name": "BatchNormalization"}, {"name": "bn2a_branch1", "inbound_nodes": [[["res2a_branch1", 0, 0, {}]]], "config": {"trainable": true, "gamma_constraint": null, "name": "bn2a_branch1", "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "axis": 3, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "gamma_regularizer": null}, "class_name": "BatchNormalization"}, {"name": "add_1", "inbound_nodes": [[["bn2a_branch2c", 0, 0, {}], ["bn2a_branch1", 0, 0, {}]]], "config": {"name": "add_1", "trainable": true}, "class_name": "Add"}, {"name": "activation_4", "inbound_nodes": [[["add_1", 0, 0, {}]]], "config": {"name": "activation_4", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"name": "res2b_branch2a", "inbound_nodes": [[["activation_4", 0, 0, {}]]], "config": {"activity_regularizer": null, "kernel_size": [1, 1], "filters": 64, "name": "res2b_branch2a", "bias_regularizer": null, "strides": [1, 1], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "dilation_rate": [1, 1], "padding": "valid", "use_bias": true, "data_format": "channels_last", "bias_constraint": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null}, "class_name": "Conv2D"}, {"name": "bn2b_branch2a", "inbound_nodes": [[["res2b_branch2a", 0, 0, {}]]], "config": {"trainable": true, "gamma_constraint": null, "name": "bn2b_branch2a", "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "axis": 3, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "gamma_regularizer": null}, "class_name": "BatchNormalization"}, {"name": "activation_5", "inbound_nodes": [[["bn2b_branch2a", 0, 0, {}]]], "config": {"name": "activation_5", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"name": "res2b_branch2b", "inbound_nodes": [[["activation_5", 0, 0, {}]]], "config": {"activity_regularizer": null, "kernel_size": [3, 3], "filters": 64, "name": "res2b_branch2b", "bias_regularizer": null, "strides": [1, 1], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "dilation_rate": [1, 1], "padding": "same", "use_bias": true, "data_format": "channels_last", "bias_constraint": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null}, "class_name": "Conv2D"}, {"name": "bn2b_branch2b", "inbound_nodes": [[["res2b_branch2b", 0, 0, {}]]], "config": {"trainable": true, "gamma_constraint": null, "name": "bn2b_branch2b", "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "axis": 3, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "gamma_regularizer": null}, "class_name": "BatchNormalization"}, {"name": "activation_6", "inbound_nodes": [[["bn2b_branch2b", 0, 0, {}]]], "config": {"name": "activation_6", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"name": "res2b_branch2c", "inbound_nodes": [[["activation_6", 0, 0, {}]]], "config": {"activity_regularizer": null, "kernel_size": [1, 1], "filters": 256, "name": "res2b_branch2c", "bias_regularizer": null, "strides": [1, 1], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "dilation_rate": [1, 1], "padding": "valid", "use_bias": true, "data_format": "channels_last", "bias_constraint": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null}, "class_name": "Conv2D"}, {"name": "bn2b_branch2c", "inbound_nodes": [[["res2b_branch2c", 0, 0, {}]]], "config": {"trainable": true, "gamma_constraint": null, "name": "bn2b_branch2c", "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "axis": 3, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "gamma_regularizer": null}, "class_name": "BatchNormalization"}, {"name": "add_2", "inbound_nodes": [[["bn2b_branch2c", 0, 0, {}], ["activation_4", 0, 0, {}]]], "config": {"name": "add_2", "trainable": true}, "class_name": "Add"}, {"name": "activation_7", "inbound_nodes": [[["add_2", 0, 0, {}]]], "config": {"name": "activation_7", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"name": "res2c_branch2a", "inbound_nodes": [[["activation_7", 0, 0, {}]]], "config": {"activity_regularizer": null, "kernel_size": [1, 1], "filters": 64, "name": "res2c_branch2a", "bias_regularizer": null, "strides": [1, 1], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "dilation_rate": [1, 1], "padding": "valid", "use_bias": true, "data_format": "channels_last", "bias_constraint": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null}, "class_name": "Conv2D"}, {"name": "bn2c_branch2a", "inbound_nodes": [[["res2c_branch2a", 0, 0, {}]]], "config": {"trainable": true, "gamma_constraint": null, "name": "bn2c_branch2a", "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "axis": 3, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "gamma_regularizer": null}, "class_name": "BatchNormalization"}, {"name": "activation_8", "inbound_nodes": [[["bn2c_branch2a", 0, 0, {}]]], "config": {"name": "activation_8", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"name": "res2c_branch2b", "inbound_nodes": [[["activation_8", 0, 0, {}]]], "config": {"activity_regularizer": null, "kernel_size": [3, 3], "filters": 64, "name": "res2c_branch2b", "bias_regularizer": null, "strides": [1, 1], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "dilation_rate": [1, 1], "padding": "same", "use_bias": true, "data_format": "channels_last", "bias_constraint": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null}, "class_name": "Conv2D"}, {"name": "bn2c_branch2b", "inbound_nodes": [[["res2c_branch2b", 0, 0, {}]]], "config": {"trainable": true, "gamma_constraint": null, "name": "bn2c_branch2b", "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "axis": 3, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "gamma_regularizer": null}, "class_name": "BatchNormalization"}, {"name": "activation_9", "inbound_nodes": [[["bn2c_branch2b", 0, 0, {}]]], "config": {"name": "activation_9", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"name": "res2c_branch2c", "inbound_nodes": [[["activation_9", 0, 0, {}]]], "config": {"activity_regularizer": null, "kernel_size": [1, 1], "filters": 256, "name": "res2c_branch2c", "bias_regularizer": null, "strides": [1, 1], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "dilation_rate": [1, 1], "padding": "valid", "use_bias": true, "data_format": "channels_last", "bias_constraint": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null}, "class_name": "Conv2D"}, {"name": "bn2c_branch2c", "inbound_nodes": [[["res2c_branch2c", 0, 0, {}]]], "config": {"trainable": true, "gamma_constraint": null, "name": "bn2c_branch2c", "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "axis": 3, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "gamma_regularizer": null}, "class_name": "BatchNormalization"}, {"name": "add_3", "inbound_nodes": [[["bn2c_branch2c", 0, 0, {}], ["activation_7", 0, 0, {}]]], "config": {"name": "add_3", "trainable": true}, "class_name": "Add"}, {"name": "activation_10", "inbound_nodes": [[["add_3", 0, 0, {}]]], "config": {"name": "activation_10", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"name": "res3a_branch2a", "inbound_nodes": [[["activation_10", 0, 0, {}]]], "config": {"activity_regularizer": null, "kernel_size": [1, 1], "filters": 128, "name": "res3a_branch2a", "bias_regularizer": null, "strides": [2, 2], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "dilation_rate": [1, 1], "padding": "valid", "use_bias": true, "data_format": "channels_last", "bias_constraint": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null}, "class_name": "Conv2D"}, {"name": "bn3a_branch2a", "inbound_nodes": [[["res3a_branch2a", 0, 0, {}]]], "config": {"trainable": true, "gamma_constraint": null, "name": "bn3a_branch2a", "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "axis": 3, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "gamma_regularizer": null}, "class_name": "BatchNormalization"}, {"name": "activation_11", "inbound_nodes": [[["bn3a_branch2a", 0, 0, {}]]], "config": {"name": "activation_11", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"name": "res3a_branch2b", "inbound_nodes": [[["activation_11", 0, 0, {}]]], "config": {"activity_regularizer": null, "kernel_size": [3, 3], "filters": 128, "name": "res3a_branch2b", "bias_regularizer": null, "strides": [1, 1], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "dilation_rate": [1, 1], "padding": "same", "use_bias": true, "data_format": "channels_last", "bias_constraint": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null}, "class_name": "Conv2D"}, {"name": "bn3a_branch2b", "inbound_nodes": [[["res3a_branch2b", 0, 0, {}]]], "config": {"trainable": true, "gamma_constraint": null, "name": "bn3a_branch2b", "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "axis": 3, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "gamma_regularizer": null}, "class_name": "BatchNormalization"}, {"name": "activation_12", "inbound_nodes": [[["bn3a_branch2b", 0, 0, {}]]], "config": {"name": "activation_12", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"name": "res3a_branch2c", "inbound_nodes": [[["activation_12", 0, 0, {}]]], "config": {"activity_regularizer": null, "kernel_size": [1, 1], "filters": 512, "name": "res3a_branch2c", "bias_regularizer": null, "strides": [1, 1], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "dilation_rate": [1, 1], "padding": "valid", "use_bias": true, "data_format": "channels_last", "bias_constraint": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null}, "class_name": "Conv2D"}, {"name": "res3a_branch1", "inbound_nodes": [[["activation_10", 0, 0, {}]]], "config": {"activity_regularizer": null, "kernel_size": [1, 1], "filters": 512, "name": "res3a_branch1", "bias_regularizer": null, "strides": [2, 2], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "dilation_rate": [1, 1], "padding": "valid", "use_bias": true, "data_format": "channels_last", "bias_constraint": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null}, "class_name": "Conv2D"}, {"name": "bn3a_branch2c", "inbound_nodes": [[["res3a_branch2c", 0, 0, {}]]], "config": {"trainable": true, "gamma_constraint": null, "name": "bn3a_branch2c", "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "axis": 3, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "gamma_regularizer": null}, "class_name": "BatchNormalization"}, {"name": "bn3a_branch1", "inbound_nodes": [[["res3a_branch1", 0, 0, {}]]], "config": {"trainable": true, "gamma_constraint": null, "name": "bn3a_branch1", "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "axis": 3, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "gamma_regularizer": null}, "class_name": "BatchNormalization"}, {"name": "add_4", "inbound_nodes": [[["bn3a_branch2c", 0, 0, {}], ["bn3a_branch1", 0, 0, {}]]], "config": {"name": "add_4", "trainable": true}, "class_name": "Add"}, {"name": "activation_13", "inbound_nodes": [[["add_4", 0, 0, {}]]], "config": {"name": "activation_13", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"name": "res3b_branch2a", "inbound_nodes": [[["activation_13", 0, 0, {}]]], "config": {"activity_regularizer": null, "kernel_size": [1, 1], "filters": 128, "name": "res3b_branch2a", "bias_regularizer": null, "strides": [1, 1], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "dilation_rate": [1, 1], "padding": "valid", "use_bias": true, "data_format": "channels_last", "bias_constraint": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null}, "class_name": "Conv2D"}, {"name": "bn3b_branch2a", "inbound_nodes": [[["res3b_branch2a", 0, 0, {}]]], "config": {"trainable": true, "gamma_constraint": null, "name": "bn3b_branch2a", "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "axis": 3, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "gamma_regularizer": null}, "class_name": "BatchNormalization"}, {"name": "activation_14", "inbound_nodes": [[["bn3b_branch2a", 0, 0, {}]]], "config": {"name": "activation_14", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"name": "res3b_branch2b", "inbound_nodes": [[["activation_14", 0, 0, {}]]], "config": {"activity_regularizer": null, "kernel_size": [3, 3], "filters": 128, "name": "res3b_branch2b", "bias_regularizer": null, "strides": [1, 1], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "dilation_rate": [1, 1], "padding": "same", "use_bias": true, "data_format": "channels_last", "bias_constraint": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null}, "class_name": "Conv2D"}, {"name": "bn3b_branch2b", "inbound_nodes": [[["res3b_branch2b", 0, 0, {}]]], "config": {"trainable": true, "gamma_constraint": null, "name": "bn3b_branch2b", "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "axis": 3, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "gamma_regularizer": null}, "class_name": "BatchNormalization"}, {"name": "activation_15", "inbound_nodes": [[["bn3b_branch2b", 0, 0, {}]]], "config": {"name": "activation_15", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"name": "res3b_branch2c", "inbound_nodes": [[["activation_15", 0, 0, {}]]], "config": {"activity_regularizer": null, "kernel_size": [1, 1], "filters": 512, "name": "res3b_branch2c", "bias_regularizer": null, "strides": [1, 1], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "dilation_rate": [1, 1], "padding": "valid", "use_bias": true, "data_format": "channels_last", "bias_constraint": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null}, "class_name": "Conv2D"}, {"name": "bn3b_branch2c", "inbound_nodes": [[["res3b_branch2c", 0, 0, {}]]], "config": {"trainable": true, "gamma_constraint": null, "name": "bn3b_branch2c", "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "axis": 3, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "gamma_regularizer": null}, "class_name": "BatchNormalization"}, {"name": "add_5", "inbound_nodes": [[["bn3b_branch2c", 0, 0, {}], ["activation_13", 0, 0, {}]]], "config": {"name": "add_5", "trainable": true}, "class_name": "Add"}, {"name": "activation_16", "inbound_nodes": [[["add_5", 0, 0, {}]]], "config": {"name": "activation_16", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"name": "res3c_branch2a", "inbound_nodes": [[["activation_16", 0, 0, {}]]], "config": {"activity_regularizer": null, "kernel_size": [1, 1], "filters": 128, "name": "res3c_branch2a", "bias_regularizer": null, "strides": [1, 1], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "dilation_rate": [1, 1], "padding": "valid", "use_bias": true, "data_format": "channels_last", "bias_constraint": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null}, "class_name": "Conv2D"}, {"name": "bn3c_branch2a", "inbound_nodes": [[["res3c_branch2a", 0, 0, {}]]], "config": {"trainable": true, "gamma_constraint": null, "name": "bn3c_branch2a", "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "axis": 3, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "gamma_regularizer": null}, "class_name": "BatchNormalization"}, {"name": "activation_17", "inbound_nodes": [[["bn3c_branch2a", 0, 0, {}]]], "config": {"name": "activation_17", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"name": "res3c_branch2b", "inbound_nodes": [[["activation_17", 0, 0, {}]]], "config": {"activity_regularizer": null, "kernel_size": [3, 3], "filters": 128, "name": "res3c_branch2b", "bias_regularizer": null, "strides": [1, 1], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "dilation_rate": [1, 1], "padding": "same", "use_bias": true, "data_format": "channels_last", "bias_constraint": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null}, "class_name": "Conv2D"}, {"name": "bn3c_branch2b", "inbound_nodes": [[["res3c_branch2b", 0, 0, {}]]], "config": {"trainable": true, "gamma_constraint": null, "name": "bn3c_branch2b", "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "axis": 3, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "gamma_regularizer": null}, "class_name": "BatchNormalization"}, {"name": "activation_18", "inbound_nodes": [[["bn3c_branch2b", 0, 0, {}]]], "config": {"name": "activation_18", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"name": "res3c_branch2c", "inbound_nodes": [[["activation_18", 0, 0, {}]]], "config": {"activity_regularizer": null, "kernel_size": [1, 1], "filters": 512, "name": "res3c_branch2c", "bias_regularizer": null, "strides": [1, 1], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "dilation_rate": [1, 1], "padding": "valid", "use_bias": true, "data_format": "channels_last", "bias_constraint": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null}, "class_name": "Conv2D"}, {"name": "bn3c_branch2c", "inbound_nodes": [[["res3c_branch2c", 0, 0, {}]]], "config": {"trainable": true, "gamma_constraint": null, "name": "bn3c_branch2c", "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "axis": 3, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "gamma_regularizer": null}, "class_name": "BatchNormalization"}, {"name": "add_6", "inbound_nodes": [[["bn3c_branch2c", 0, 0, {}], ["activation_16", 0, 0, {}]]], "config": {"name": "add_6", "trainable": true}, "class_name": "Add"}, {"name": "activation_19", "inbound_nodes": [[["add_6", 0, 0, {}]]], "config": {"name": "activation_19", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"name": "res3d_branch2a", "inbound_nodes": [[["activation_19", 0, 0, {}]]], "config": {"activity_regularizer": null, "kernel_size": [1, 1], "filters": 128, "name": "res3d_branch2a", "bias_regularizer": null, "strides": [1, 1], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "dilation_rate": [1, 1], "padding": "valid", "use_bias": true, "data_format": "channels_last", "bias_constraint": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null}, "class_name": "Conv2D"}, {"name": "bn3d_branch2a", "inbound_nodes": [[["res3d_branch2a", 0, 0, {}]]], "config": {"trainable": true, "gamma_constraint": null, "name": "bn3d_branch2a", "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "axis": 3, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "gamma_regularizer": null}, "class_name": "BatchNormalization"}, {"name": "activation_20", "inbound_nodes": [[["bn3d_branch2a", 0, 0, {}]]], "config": {"name": "activation_20", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"name": "res3d_branch2b", "inbound_nodes": [[["activation_20", 0, 0, {}]]], "config": {"activity_regularizer": null, "kernel_size": [3, 3], "filters": 128, "name": "res3d_branch2b", "bias_regularizer": null, "strides": [1, 1], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "dilation_rate": [1, 1], "padding": "same", "use_bias": true, "data_format": "channels_last", "bias_constraint": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null}, "class_name": "Conv2D"}, {"name": "bn3d_branch2b", "inbound_nodes": [[["res3d_branch2b", 0, 0, {}]]], "config": {"trainable": true, "gamma_constraint": null, "name": "bn3d_branch2b", "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "axis": 3, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "gamma_regularizer": null}, "class_name": "BatchNormalization"}, {"name": "activation_21", "inbound_nodes": [[["bn3d_branch2b", 0, 0, {}]]], "config": {"name": "activation_21", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"name": "res3d_branch2c", "inbound_nodes": [[["activation_21", 0, 0, {}]]], "config": {"activity_regularizer": null, "kernel_size": [1, 1], "filters": 512, "name": "res3d_branch2c", "bias_regularizer": null, "strides": [1, 1], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "dilation_rate": [1, 1], "padding": "valid", "use_bias": true, "data_format": "channels_last", "bias_constraint": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null}, "class_name": "Conv2D"}, {"name": "bn3d_branch2c", "inbound_nodes": [[["res3d_branch2c", 0, 0, {}]]], "config": {"trainable": true, "gamma_constraint": null, "name": "bn3d_branch2c", "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "axis": 3, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "gamma_regularizer": null}, "class_name": "BatchNormalization"}, {"name": "add_7", "inbound_nodes": [[["bn3d_branch2c", 0, 0, {}], ["activation_19", 0, 0, {}]]], "config": {"name": "add_7", "trainable": true}, "class_name": "Add"}, {"name": "activation_22", "inbound_nodes": [[["add_7", 0, 0, {}]]], "config": {"name": "activation_22", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"name": "res4a_branch2a", "inbound_nodes": [[["activation_22", 0, 0, {}]]], "config": {"activity_regularizer": null, "kernel_size": [1, 1], "filters": 256, "name": "res4a_branch2a", "bias_regularizer": null, "strides": [2, 2], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "dilation_rate": [1, 1], "padding": "valid", "use_bias": true, "data_format": "channels_last", "bias_constraint": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null}, "class_name": "Conv2D"}, {"name": "bn4a_branch2a", "inbound_nodes": [[["res4a_branch2a", 0, 0, {}]]], "config": {"trainable": true, "gamma_constraint": null, "name": "bn4a_branch2a", "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "axis": 3, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "gamma_regularizer": null}, "class_name": "BatchNormalization"}, {"name": "activation_23", "inbound_nodes": [[["bn4a_branch2a", 0, 0, {}]]], "config": {"name": "activation_23", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"name": "res4a_branch2b", "inbound_nodes": [[["activation_23", 0, 0, {}]]], "config": {"activity_regularizer": null, "kernel_size": [3, 3], "filters": 256, "name": "res4a_branch2b", "bias_regularizer": null, "strides": [1, 1], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "dilation_rate": [1, 1], "padding": "same", "use_bias": true, "data_format": "channels_last", "bias_constraint": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null}, "class_name": "Conv2D"}, {"name": "bn4a_branch2b", "inbound_nodes": [[["res4a_branch2b", 0, 0, {}]]], "config": {"trainable": true, "gamma_constraint": null, "name": "bn4a_branch2b", "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "axis": 3, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "gamma_regularizer": null}, "class_name": "BatchNormalization"}, {"name": "activation_24", "inbound_nodes": [[["bn4a_branch2b", 0, 0, {}]]], "config": {"name": "activation_24", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"name": "res4a_branch2c", "inbound_nodes": [[["activation_24", 0, 0, {}]]], "config": {"activity_regularizer": null, "kernel_size": [1, 1], "filters": 1024, "name": "res4a_branch2c", "bias_regularizer": null, "strides": [1, 1], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "dilation_rate": [1, 1], "padding": "valid", "use_bias": true, "data_format": "channels_last", "bias_constraint": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null}, "class_name": "Conv2D"}, {"name": "res4a_branch1", "inbound_nodes": [[["activation_22", 0, 0, {}]]], "config": {"activity_regularizer": null, "kernel_size": [1, 1], "filters": 1024, "name": "res4a_branch1", "bias_regularizer": null, "strides": [2, 2], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "dilation_rate": [1, 1], "padding": "valid", "use_bias": true, "data_format": "channels_last", "bias_constraint": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null}, "class_name": "Conv2D"}, {"name": "bn4a_branch2c", "inbound_nodes": [[["res4a_branch2c", 0, 0, {}]]], "config": {"trainable": true, "gamma_constraint": null, "name": "bn4a_branch2c", "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "axis": 3, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "gamma_regularizer": null}, "class_name": "BatchNormalization"}, {"name": "bn4a_branch1", "inbound_nodes": [[["res4a_branch1", 0, 0, {}]]], "config": {"trainable": true, "gamma_constraint": null, "name": "bn4a_branch1", "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "axis": 3, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "gamma_regularizer": null}, "class_name": "BatchNormalization"}, {"name": "add_8", "inbound_nodes": [[["bn4a_branch2c", 0, 0, {}], ["bn4a_branch1", 0, 0, {}]]], "config": {"name": "add_8", "trainable": true}, "class_name": "Add"}, {"name": "activation_25", "inbound_nodes": [[["add_8", 0, 0, {}]]], "config": {"name": "activation_25", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"name": "res4b_branch2a", "inbound_nodes": [[["activation_25", 0, 0, {}]]], "config": {"activity_regularizer": null, "kernel_size": [1, 1], "filters": 256, "name": "res4b_branch2a", "bias_regularizer": null, "strides": [1, 1], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "dilation_rate": [1, 1], "padding": "valid", "use_bias": true, "data_format": "channels_last", "bias_constraint": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null}, "class_name": "Conv2D"}, {"name": "bn4b_branch2a", "inbound_nodes": [[["res4b_branch2a", 0, 0, {}]]], "config": {"trainable": true, "gamma_constraint": null, "name": "bn4b_branch2a", "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "axis": 3, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "gamma_regularizer": null}, "class_name": "BatchNormalization"}, {"name": "activation_26", "inbound_nodes": [[["bn4b_branch2a", 0, 0, {}]]], "config": {"name": "activation_26", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"name": "res4b_branch2b", "inbound_nodes": [[["activation_26", 0, 0, {}]]], "config": {"activity_regularizer": null, "kernel_size": [3, 3], "filters": 256, "name": "res4b_branch2b", "bias_regularizer": null, "strides": [1, 1], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "dilation_rate": [1, 1], "padding": "same", "use_bias": true, "data_format": "channels_last", "bias_constraint": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null}, "class_name": "Conv2D"}, {"name": "bn4b_branch2b", "inbound_nodes": [[["res4b_branch2b", 0, 0, {}]]], "config": {"trainable": true, "gamma_constraint": null, "name": "bn4b_branch2b", "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "axis": 3, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "gamma_regularizer": null}, "class_name": "BatchNormalization"}, {"name": "activation_27", "inbound_nodes": [[["bn4b_branch2b", 0, 0, {}]]], "config": {"name": "activation_27", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"name": "res4b_branch2c", "inbound_nodes": [[["activation_27", 0, 0, {}]]], "config": {"activity_regularizer": null, "kernel_size": [1, 1], "filters": 1024, "name": "res4b_branch2c", "bias_regularizer": null, "strides": [1, 1], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "dilation_rate": [1, 1], "padding": "valid", "use_bias": true, "data_format": "channels_last", "bias_constraint": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null}, "class_name": "Conv2D"}, {"name": "bn4b_branch2c", "inbound_nodes": [[["res4b_branch2c", 0, 0, {}]]], "config": {"trainable": true, "gamma_constraint": null, "name": "bn4b_branch2c", "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "axis": 3, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "gamma_regularizer": null}, "class_name": "BatchNormalization"}, {"name": "add_9", "inbound_nodes": [[["bn4b_branch2c", 0, 0, {}], ["activation_25", 0, 0, {}]]], "config": {"name": "add_9", "trainable": true}, "class_name": "Add"}, {"name": "activation_28", "inbound_nodes": [[["add_9", 0, 0, {}]]], "config": {"name": "activation_28", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"name": "res4c_branch2a", "inbound_nodes": [[["activation_28", 0, 0, {}]]], "config": {"activity_regularizer": null, "kernel_size": [1, 1], "filters": 256, "name": "res4c_branch2a", "bias_regularizer": null, "strides": [1, 1], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "dilation_rate": [1, 1], "padding": "valid", "use_bias": true, "data_format": "channels_last", "bias_constraint": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null}, "class_name": "Conv2D"}, {"name": "bn4c_branch2a", "inbound_nodes": [[["res4c_branch2a", 0, 0, {}]]], "config": {"trainable": true, "gamma_constraint": null, "name": "bn4c_branch2a", "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "axis": 3, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "gamma_regularizer": null}, "class_name": "BatchNormalization"}, {"name": "activation_29", "inbound_nodes": [[["bn4c_branch2a", 0, 0, {}]]], "config": {"name": "activation_29", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"name": "res4c_branch2b", "inbound_nodes": [[["activation_29", 0, 0, {}]]], "config": {"activity_regularizer": null, "kernel_size": [3, 3], "filters": 256, "name": "res4c_branch2b", "bias_regularizer": null, "strides": [1, 1], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "dilation_rate": [1, 1], "padding": "same", "use_bias": true, "data_format": "channels_last", "bias_constraint": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null}, "class_name": "Conv2D"}, {"name": "bn4c_branch2b", "inbound_nodes": [[["res4c_branch2b", 0, 0, {}]]], "config": {"trainable": true, "gamma_constraint": null, "name": "bn4c_branch2b", "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "axis": 3, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "gamma_regularizer": null}, "class_name": "BatchNormalization"}, {"name": "activation_30", "inbound_nodes": [[["bn4c_branch2b", 0, 0, {}]]], "config": {"name": "activation_30", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"name": "res4c_branch2c", "inbound_nodes": [[["activation_30", 0, 0, {}]]], "config": {"activity_regularizer": null, "kernel_size": [1, 1], "filters": 1024, "name": "res4c_branch2c", "bias_regularizer": null, "strides": [1, 1], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "dilation_rate": 